
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОстаткиПродуктов.Записывать = Истина;
	Движения.ОстаткиБлюд.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ТекСтрокаТовары.ЕдиницыИзмерения = Перечисления.ЕдиницыИзмерения.Порция Тогда
			Движение = Движения.ОстаткиБлюд.Добавить();
			Движение.Блюдо = ТекСтрокаТовары.Товары;
		Иначе
			Движение = Движения.ОстаткиПродуктов.Добавить();
			Движение.Продукт = ТекСтрокаТовары.Товары;
		КонецЕсли;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Если ТекСтрокаТовары.ЕдиницыИзмерения = Перечисления.ЕдиницыИзмерения.Бутылка тогда
			Движение.Количество = ТекСтрокаТовары.Количество*Константы.БутылкаМасла.Получить();
			Движение.ЕдиницыИзмерения = Перечисления.ЕдиницыИзмерения.Килограмм;
		Иначе 
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.ЕдиницыИзмерения = ТекСтрокаТовары.ЕдиницыИзмерения;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
