
&НаСервере
Функция ТоварыЕдиницыИзмеренияПриИзмененииНаСервере(ТоварДляПродажи,ВидЗапроса)
	Запрос = Новый Запрос;
	ЗапросНаОстатокБлюд = 
	"ВЫБРАТЬ
	|	ОстаткиБлюдОстатки.Блюдо КАК Блюдо,
	|	ОстаткиБлюдОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиБлюд.Остатки КАК ОстаткиБлюдОстатки
	|ГДЕ
	|	ОстаткиБлюдОстатки.Блюдо = &Блюдо
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиБлюдОстатки.КоличествоОстаток,
	|	ОстаткиБлюдОстатки.Блюдо";
	
	ЗапросНаОстатокПродуктов = 
	"ВЫБРАТЬ
	|	ОстаткиПродуктовОстатки.Продукт КАК Продукт,
	|	ОстаткиПродуктовОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиПродуктов.Остатки КАК ОстаткиПродуктовОстатки
	|ГДЕ
	|	ОстаткиПродуктовОстатки.Продукт = &Продукт
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПродуктовОстатки.Продукт,
	|	ОстаткиПродуктовОстатки.КоличествоОстаток";
	
	Если ВидЗапроса = "ОстатокПродуктов" Тогда
		Запрос.Текст = ЗапросНаОстатокПродуктов;
		Запрос.УстановитьПараметр("Продукт",ТоварДляПродажи);
	Иначе
		Запрос.Текст = ЗапросНаОстатокБлюд;
		Запрос.УстановитьПараметр("Блюдо",ТоварДляПродажи);
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаИзЗапроса = РезультатЗапроса.Выгрузить();
	КоличествоПродуктаНаСкладе = ТаблицаИзЗапроса.Итог("КоличествоОстаток");
	Возврат КоличествоПродуктаНаСкладе;
КонецФункции

&НаКлиенте
Процедура ТоварыЕдиницыИзмеренияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ТоварДляПродажи = СтрокаТабличнойЧасти.Товары;
	КоличествоТовараДляПродажи = СтрокаТабличнойЧасти.Количество;
	ЕдиницаИзмерения = СтрокаТабличнойЧасти.ЕдиницыИзмерения;
	ВидЗапроса = "ОстатокПродуктов";
	Если Строка(ЕдиницаИзмерения) = "Порц." Тогда
		ВидЗапроса = "ОстатокБлюд";
	КонецЕсли;
	КоличествоТовараНаСкладе = ТоварыЕдиницыИзмеренияПриИзмененииНаСервере(ТоварДляПродажи,ВидЗапроса);
	Если Строка(ЕдиницаИзмерения) = "Бут." Тогда
		КоличествоТовараНаСкладе = Цел(КоличествоТовараНаСкладе/0.930);//как достучаться отсюда до констант и перечислений не понял, по этому захардкодил
		ЕдиницаИзмерения = "Бут.";
	КонецЕсли;
	
	Если КоличествоТовараНаСкладе< КоличествоТовараДляПродажи Тогда
		Сообщить("Товара ("+ТоварДляПродажи+") не достаточно. На складе осталось "+КоличествоТовараНаСкладе+" "+ЕдиницаИзмерения);
		СтрокаТабличнойЧасти.Количество = 0;
	КонецЕсли;
КонецПроцедуры
