Функция РасчитатьКоличествоПорций(Состав) Экспорт
	ОбщаяМассаБлюдаВГраммах = 0; 
	МассаПорции = Константы.Порция.Получить();
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Если ТекСтрокаСостав.ЕдиницыИзмерения = Перечисления.ЕдиницыИзмерения.Литр Тогда
			ОбщаяМассаБлюдаВГраммах = ОбщаяМассаБлюдаВГраммах+ТекСтрокаСостав.Количество*1000;
		Иначе
			ОбщаяМассаБлюдаВГраммах = ОбщаяМассаБлюдаВГраммах+ТекСтрокаСостав.Количество;
		КонецЕсли;
	КонецЦикла;
	ОбщаяМассаБлюдаВКилограммах = ОбщаяМассаБлюдаВГраммах/1000;
	КоличествоПорций = Цел(ОбщаяМассаБлюдаВКилограммах/МассаПорции);
	Возврат КоличествоПорций;
КонецФункции